brew "zinit"
brew "oh-my-posh"
brew "fzf"
brew "fd"
brew "bat"
brew "ripgrep"
brew "zoxide"
brew "atuin"
brew "viddy"
brew "helix"
brew "yazi"
brew "diff-so-fancy"
brew "git-delta"
brew "stow"
brew "direnv"
brew "tmux"

cask "ghostty"
cask "rectangle"
cask "font-jetbrains-mono-nerd-font"
