brew "zinit"
brew "oh-my-posh"
brew "fzf"
brew "fd"
brew "bat"
brew "ripgrep"
brew "zoxide"
brew "atuin"
brew "viddy"
brew "helix"
brew "yazi"
brew "diff-so-fancy"
brew "git-delta"
brew "stow"
brew "direnv"
brew "tmux"
brew "jq"
brew "gh"
brew "kubectx"

if OS.mac?
  cask "claude-code"
  cask "copilot-cli"
  cask "ghostty"
  cask "rectangle"
  cask "font-jetbrains-mono-nerd-font"
end

if OS.linux?
  # On macOS, these ship as casks; on Linux they're formulae
  brew "claude-code"
  brew "copilot-cli"
end
